app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY created_at DESC
---
	def index
		@books = Book.all.order('created_at DESC')

UPDATE "books" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["image_file_name", "1.jpg"], ["image_file_size", 18186], ["image_updated_at", 2017-03-08 19:01:15 UTC], ["updated_at", 2017-03-08 19:01:16 UTC], ["id", 14]]
---
	def update
		if @book.update(book_params)

INSERT INTO "books" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["description", ""], ["created_at", 2017-02-14 20:08:32 UTC], ["updated_at", 2017-02-14 20:08:32 UTC]]
---
	def create
		@book =Book.new(book_params)
		if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
	def find_book
		@book=Book.find(params[:id])